yukebrillianth/triagebox_stm32_node/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_Pin GPIO_PIN_13
#define LED_GPIO_Port GPIOC
#define AD8232_ADC_Pin GPIO_PIN_1
#define AD8232_ADC_GPIO_Port GPIOA
#define MIC_ADC_Pin GPIO_PIN_2
#define MIC_ADC_GPIO_Port GPIOA
#define SX1278_NSS_Pin GPIO_PIN_0
#define SX1278_NSS_GPIO_Port GPIOB
#define SX1278_DIO0_Pin GPIO_PIN_1
#define SX1278_DIO0_GPIO_Port GPIOB
#define SPI1_RST_Pin GPIO_PIN_2
#define SPI1_RST_GPIO_Port GPIOB
#define BUTTON_1_Pin GPIO_PIN_12
#define BUTTON_1_GPIO_Port GPIOB
#define BUTTON_2_Pin GPIO_PIN_13
#define BUTTON_2_GPIO_Port GPIOB
#define BUTTON_3_Pin GPIO_PIN_14
#define BUTTON_3_GPIO_Port GPIOB
#define BUTTON_4_Pin GPIO_PIN_15
#define BUTTON_4_GPIO_Port GPIOB
#define MAX30102_INT_Pin GPIO_PIN_5
#define MAX30102_INT_GPIO_Port GPIOB
#define MAX30102_INT_EXTI_IRQn EXTI9_5_IRQn

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
